VEHICLE_IMAGE_PATH = 'Resources/Vehicles/'
ICONS_IMAGE_PATH = 'Resources/Icons/'

-- Элемент даты для защиты и не только
ELEMENT_DATA_NAMES = 
{
	ID = 'ID',
	Owner = 'owner',
	Parent = 'parent',
	Vehicles = 'vehicles',
	Number = 'number'
}

-- Прописи автосалонов и автомобилей

AUTOSHOP_LIST = 
{
	[ 'Автосалон премиум класса' ] = 
	{
		vPosition = Vector3( -2417, -608, 131.5 ), -- Позиция
		vCamPosition = Vector3( -2434, -616, 133 ), -- Позиция камеры
		vCamToPosition  = Vector3( -2441, -618, 132 ),
		vSpawnPosition = { -2441, -618, 132, 50 }, -- Позиция покупки автомобиля { x, y, z, rz }

		sIconName = 'premium', -- Название картинки без формата в формате .png

		aVehiclesList = 
		{
			{
				iModel = 400, -- Модель автомобиля
				sName = 'Cadillac Escalade', -- Название автомобиля
				iPrice = 7700000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 401, -- Модель автомобиля
				sName = 'BMW I8', -- Название автомобиля
				iPrice = 18900000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 415, -- Модель автомобиля
				sName = 'Lamborghini Huracan', -- Название автомобиля
				iPrice = 15750000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 418, -- Модель автомобиля
				sName = 'Range Rover', -- Название автомобиля
				iPrice = 6375000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 421, -- Модель автомобиля
				sName = 'BMW X5M', -- Название автомобиля
				iPrice = 8400000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 445, -- Модель автомобиля
				sName = 'Toyota Land Cruiser', -- Название автомобиля
				iPrice = 4900000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 451, -- Модель автомобиля
				sName = 'Ferrari 458', -- Название автомобиля
				iPrice = 18900000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 470, -- Модель автомобиля
				sName = 'Cayenne', -- Название автомобиля
				iPrice = 10500000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 474, -- Модель автомобиля
				sName = 'BMW M8', -- Название автомобиля
				iPrice = 11550000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			},
			{
				iModel = 479, -- Модель автомобиля
				sName = 'Mercedes GL', -- Название автомобиля
				iPrice = 6000000, -- Цена
				sHandling = 'LANDSTALKER 2000 5848.3 2 0 0 -0.3 85 0.9 0.8 0.5 5 200 17 120 4 d 99 0.6 false 50 1.4 0.1 0 0.35 -0.1 0.5 0 0.2 0.75 25000 20 0 0 1 0', -- Хандлиг
			}
		}
	}
}

SELL_VEHICLE_POSITION 	= Vector3( -2420.896484375, -617.4765625, 131.56742858887 )

CHANGE_NUMBERS_POSITION = Vector3( -2414.404296875, -615.7890625, 131.62370300293 )

PRICE_CHANGE_NUMBERS 	= 50000